{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[BOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[EOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "[PAD]": 0,
            "[BOS]": 1,
            "[EOS]": 2,
            "(": 3,
            ")": 4,
            ",": 5,
            ".": 6,
            "0": 7,
            "1": 8,
            "4": 9,
            "9": 10,
            "<": 11,
            "=": 12,
            "C": 13,
            "F": 14,
            "H": 15,
            "M": 16,
            "P": 17,
            "[": 18,
            "\\": 19,
            "]": 20,
            "_": 21,
            "a": 22,
            "b": 23,
            "c": 24,
            "d": 25,
            "e": 26,
            "f": 27,
            "g": 28,
            "h": 29,
            "i": 30,
            "l": 31,
            "m": 32,
            "n": 33,
            "o": 34,
            "r": 35,
            "s": 36,
            "t": 37,
            "u": 38,
            "x": 39,
            "y": 40,
            "z": 41,
            "{": 42,
            "}": 43,
            "~": 44,
            "Ċ": 45,
            "Ġ": 46,
            "Ġ,": 47,
            "Ġ{": 48,
            "Ġ}": 49,
            "ma": 50,
            "Ġ)": 51,
            "Ġ0": 52,
            "Ġ\\": 53,
            "th": 54,
            "Ġ1": 55,
            "Ġ=": 56,
            "Ġ_": 57,
            "Ġi": 58,
            "math": 59,
            "rm": 60,
            "Ġ(": 61,
            "Ġn": 62,
            "Ġx": 63,
            "Ġy": 64,
            "Ġz": 65,
            "mathrm": 66,
            "am": 67,
            "do": 68,
            "gma": 69,
            "gam": 70,
            "igma": 71,
            "ldo": 72,
            "sigma": 73,
            "ts": 74,
            "tt": 75,
            "Ġ.": 76,
            "Ġ4": 77,
            "Ġ9": 78,
            "Ġ<": 79,
            "ĠC": 80,
            "ĠH": 81,
            "ĠM": 82,
            "ĠP": 83,
            "Ġ[": 84,
            "Ġ]": 85,
            "Ġa": 86,
            "Ġb": 87,
            "Ġc": 88,
            "Ġe": 89,
            "Ġf": 90,
            "Ġh": 91,
            "Ġm": 92,
            "Ġr": 93,
            "Ġu": 94,
            "Ġ~": 95,
            "mathtt": 96,
            "gamma": 97,
            "ldots": 98
        },
        "merges": [
            "Ġ ,",
            "Ġ {",
            "Ġ }",
            "m a",
            "Ġ )",
            "Ġ 0",
            "Ġ \\",
            "t h",
            "Ġ 1",
            "Ġ =",
            "Ġ _",
            "Ġ i",
            "ma th",
            "r m",
            "Ġ (",
            "Ġ n",
            "Ġ x",
            "Ġ y",
            "Ġ z",
            "math rm",
            "a m",
            "d o",
            "g ma",
            "g am",
            "i gma",
            "l do",
            "s igma",
            "t s",
            "t t",
            "Ġ .",
            "Ġ 4",
            "Ġ 9",
            "Ġ <",
            "Ġ C",
            "Ġ H",
            "Ġ M",
            "Ġ P",
            "Ġ [",
            "Ġ ]",
            "Ġ a",
            "Ġ b",
            "Ġ c",
            "Ġ e",
            "Ġ f",
            "Ġ h",
            "Ġ m",
            "Ġ r",
            "Ġ u",
            "Ġ ~",
            "math tt",
            "gam ma",
            "ldo ts"
        ]
    }
}