{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[BOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[EOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "ignore_merges": false,
        "vocab": {
            "[PAD]": 0,
            "[BOS]": 1,
            "[EOS]": 2,
            "!": 3,
            "\"": 4,
            "#": 5,
            "%": 6,
            "&": 7,
            "'": 8,
            "(": 9,
            ")": 10,
            "*": 11,
            "+": 12,
            ",": 13,
            "-": 14,
            ".": 15,
            "/": 16,
            "0": 17,
            "1": 18,
            "2": 19,
            "3": 20,
            "4": 21,
            "5": 22,
            "6": 23,
            "7": 24,
            "8": 25,
            "9": 26,
            ":": 27,
            ";": 28,
            "<": 29,
            "=": 30,
            ">": 31,
            "?": 32,
            "@": 33,
            "A": 34,
            "B": 35,
            "C": 36,
            "D": 37,
            "E": 38,
            "F": 39,
            "G": 40,
            "H": 41,
            "I": 42,
            "J": 43,
            "K": 44,
            "L": 45,
            "M": 46,
            "N": 47,
            "O": 48,
            "P": 49,
            "Q": 50,
            "R": 51,
            "S": 52,
            "T": 53,
            "U": 54,
            "V": 55,
            "W": 56,
            "X": 57,
            "Y": 58,
            "Z": 59,
            "[": 60,
            "\\": 61,
            "]": 62,
            "^": 63,
            "_": 64,
            "`": 65,
            "a": 66,
            "b": 67,
            "c": 68,
            "d": 69,
            "e": 70,
            "f": 71,
            "g": 72,
            "h": 73,
            "i": 74,
            "j": 75,
            "k": 76,
            "l": 77,
            "m": 78,
            "n": 79,
            "o": 80,
            "p": 81,
            "q": 82,
            "r": 83,
            "s": 84,
            "t": 85,
            "u": 86,
            "v": 87,
            "w": 88,
            "x": 89,
            "y": 90,
            "z": 91,
            "{": 92,
            "|": 93,
            "}": 94,
            "~": 95,
            "¡": 96,
            "£": 97,
            "¤": 98,
            "¦": 99,
            "¨": 100,
            "©": 101,
            "«": 102,
            "®": 103,
            "¯": 104,
            "°": 105,
            "±": 106,
            "²": 107,
            "³": 108,
            "´": 109,
            "µ": 110,
            "¶": 111,
            "·": 112,
            "¸": 113,
            "¹": 114,
            "º": 115,
            "»": 116,
            "¼": 117,
            "½": 118,
            "¿": 119,
            "Â": 120,
            "Ã": 121,
            "Ä": 122,
            "Î": 123,
            "Ï": 124,
            "Ð": 125,
            "Ñ": 126,
            "á": 127,
            "â": 128,
            "ï": 129,
            "ð": 130,
            "Ċ": 131,
            "Ġ": 132,
            "Ģ": 133,
            "ģ": 134,
            "ĥ": 135,
            "Ħ": 136,
            "ħ": 137,
            "Ĩ": 138,
            "ĩ": 139,
            "Ī": 140,
            "ī": 141,
            "Ĭ": 142,
            "ĭ": 143,
            "Į": 144,
            "į": 145,
            "Ĳ": 146,
            "ĳ": 147,
            "Ĵ": 148,
            "ĵ": 149,
            "Ķ": 150,
            "ķ": 151,
            "Ĺ": 152,
            "ĺ": 153,
            "Ļ": 154,
            "Ŀ": 155,
            "ŀ": 156,
            "Ł": 157,
            "ł": 158,
            "Ġ}": 159,
            "Ġ{": 160,
            "Ġ\\": 161,
            "Ġ_": 162,
            "Ġ^": 163,
            "Ġ)": 164,
            "Ġ2": 165,
            "Ġ(": 166,
            "Ġ1": 167,
            "ra": 168,
            "ma": 169,
            "th": 170,
            "Ġ-": 171,
            "Ġ,": 172,
            "math": 173,
            "Ġ=": 174,
            "ar": 175,
            "Ġ+": 176,
            "Ġ0": 177,
            "ig": 178,
            "fra": 179,
            "frac": 180,
            "ta": 181,
            "le": 182,
            "Ġi": 183,
            "Ġ&": 184,
            "al": 185,
            "in": 186,
            "me": 187,
            "Ġt": 188,
            "Ġx": 189,
            "ft": 190,
            "Ġr": 191,
            "Ġ~": 192,
            "rm": 193,
            "Ġn": 194,
            "igh": 195,
            "ight": 196,
            "right": 197,
            "mathrm": 198,
            "left": 199,
            "ray": 200,
            "array": 201,
            "Ġk": 202,
            "ti": 203,
            "eta": 204,
            "Ġl": 205,
            "ha": 206,
            "Ġd": 207,
            "bf": 208,
            "Ġa": 209,
            "Ġ.": 210,
            "Ġe": 211,
            "ga": 212,
            "Ġm": 213,
            "Ġ3": 214,
            "Ġ\\\\": 215,
            "de": 216,
            "Ġs": 217,
            "Ġj": 218,
            "Ġp": 219,
            "la": 220,
            "Ġc": 221,
            "mathbf": 222,
            "si": 223,
            "mb": 224,
            "Ġ\\,": 225,
            "Ġ|": 226,
            "pr": 227,
            "en": 228,
            "par": 229,
            "hi": 230,
            "Ġu": 231,
            "tial": 232,
            "partial": 233,
            "eg": 234,
            "end": 235,
            "beg": 236,
            "begin": 237,
            "lta": 238,
            "mega": 239,
            "ime": 240,
            "prime": 241,
            "ol": 242,
            "Ġf": 243,
            "Ġ4": 244,
            "pha": 245,
            "ot": 246,
            "alpha": 247,
            "Ġy": 248,
            "psi": 249,
            "dot": 250,
            "da": 251,
            "Ġz": 252,
            "ĠT": 253,
            "Ġ/": 254,
            "cal": 255,
            "ĠA": 256,
            "mma": 257,
            "ng": 258,
            "Ġb": 259,
            "hat": 260,
            "mu": 261,
            "ngle": 262,
            "ĠR": 263,
            "Ġv": 264,
            "su": 265,
            "phi": 266,
            "ĠN": 267,
            "lo": 268,
            "rt": 269,
            "mbda": 270,
            "omega": 271,
            "ve": 272,
            "ĠL": 273,
            "Ġq": 274,
            "theta": 275,
            "igma": 276,
            "sum": 277,
            "Ġg": 278,
            "ĠE": 279,
            "mathcal": 280,
            "Ġh": 281,
            "ĠB": 282,
            "sigma": 283,
            "psilo": 284,
            "psilon": 285,
            "ĠS": 286,
            "pi": 287,
            "epsilon": 288,
            "ho": 289,
            "rho": 290,
            "lambda": 291,
            "na": 292,
            "beta": 293,
            "lde": 294,
            "int": 295,
            "ĠP": 296,
            "var": 297,
            "gamma": 298,
            "Ġ]": 299,
            "ĠC": 300,
            "tilde": 301,
            "delta": 302,
            "cdot": 303,
            "Ġ5": 304,
            "Ġ[": 305,
            "tau": 306,
            "ĠD": 307,
            "Ġo": 308,
            "ĠM": 309,
            "bol": 310,
            "bold": 311,
            "ĠF": 312,
            "qu": 313,
            "ĠH": 314,
            "bar": 315,
            "sq": 316,
            "sy": 317,
            "sqrt": 318,
            "mbol": 319,
            "boldsy": 320,
            "boldsymbol": 321,
            "De": 322,
            "Delta": 323,
            "nu": 324,
            "ĠI": 325,
            "to": 326,
            "Ġ*": 327,
            "rangle": 328,
            "ĠX": 329,
            "big": 330,
            "ĠV": 331,
            "Ġ\\!": 332,
            "ad": 333,
            "quad": 334,
            "Ġ6": 335,
            "ex": 336,
            "Ġw": 337,
            "Ġ\\;": 338,
            "time": 339,
            "times": 340,
            "ap": 341,
            "ĠG": 342,
            "Ġ\\|": 343,
            "xi": 344,
            "pe": 345,
            "langle": 346,
            "inft": 347,
            "infty": 348,
            "mathb": 349,
            "mathbb": 350,
            "ĠK": 351,
            "bla": 352,
            "nabla": 353,
            "Ġ8": 354,
            "vec": 355,
            "Omega": 356,
            "ĠQ": 357,
            "ll": 358,
            "ĠU": 359,
            "ge": 360,
            "pa": 361,
            "tex": 362,
            "Big": 363,
            "varepsilon": 364,
            "name": 365,
            "ope": 366,
            "rname": 367,
            "rato": 368,
            "operato": 369,
            "operatorname": 370,
            "ow": 371,
            "text": 372,
            "rl": 373,
            "ine": 374,
            "rline": 375,
            "amma": 376,
            "Gamma": 377,
            "ĠJ": 378,
            "ĠW": 379,
            "co": 380,
            "Ġ7": 381,
            "ove": 382,
            "row": 383,
            "kap": 384,
            "kappa": 385,
            "sin": 386,
            "ell": 387,
            "cos": 388,
            "leq": 389,
            "varphi": 390,
            "overline": 391,
            "Ġ\\}": 392,
            "arrow": 393,
            "Ġ9": 394,
            "ide": 395,
            "wide": 396,
            "ĠZ": 397,
            "dots": 398,
            "pro": 399,
            "Ġ;": 400,
            "Ġ\\{": 401,
            "st": 402,
            "pm": 403,
            "ĠY": 404,
            "Ġ<": 405,
            "ĠO": 406,
            "Phi": 407,
            "chi": 408,
            "rightarrow": 409,
            "Ġ:": 410,
            "dag": 411,
            "\\{": 412,
            "vert": 413,
            "sim": 414,
            "zeta": 415,
            "Ġ>": 416,
            "bigg": 417,
            "La": 418,
            "Lambda": 419,
            "ger": 420,
            "dagger": 421,
            "qquad": 422,
            "textbf": 423,
            "Psi": 424,
            "prox": 425,
            "approx": 426,
            "widetilde": 427,
            "exp": 428,
            "cdots": 429,
            "hbar": 430,
            "log": 431,
            "ln": 432,
            "iv": 433,
            "Ve": 434,
            "re": 435,
            "widehat": 436,
            "equ": 437,
            "equiv": 438,
            "Sigma": 439,
            "Vert": 440,
            "sc": 441,
            "geq": 442,
            "se": 443,
            "yle": 444,
            "style": 445,
            "otimes": 446,
            "ldots": 447,
            "textrm": 448,
            "un": 449,
            "unde": 450,
            "set": 451,
            "\\}": 452,
            "Ġ!": 453,
            "rc": 454,
            "per": 455,
            "sure": 456,
            "perp": 457,
            "ensure": 458,
            "ensuremath": 459,
            "scr": 460,
            "ci": 461,
            "circ": 462,
            "eq": 463,
            "mathfra": 464,
            "mathfrak": 465,
            "sf": 466,
            "Pi": 467,
            "up": 468,
            "di": 469,
            "prod": 470,
            "\\|": 471,
            "ast": 472,
            "sp": 473,
            "Th": 474,
            "Theta": 475,
            "mi": 476,
            "lay": 477,
            "disp": 478,
            "display": 479,
            "mathsf": 480,
            "displaystyle": 481,
            "neq": 482,
            "lle": 483,
            "ck": 484,
            "ce": 485,
            "bra": 486,
            "mid": 487,
            "underline": 488,
            "ed": 489,
            "us": 490,
            "wed": 491,
            "wedge": 492,
            "Ġ\\%": 493,
            "pt": 494,
            "para": 495,
            "llel": 496,
            "parallel": 497,
            "Bigg": 498,
            "Ġ\\:": 499,
            "star": 500,
            "meq": 501,
            "simeq": 502,
            "brace": 503,
            "or": 504,
            "ipt": 505,
            "script": 506,
            "top": 507,
            "pmb": 508,
            "under": 509,
            "vdots": 510,
            "fo": 511,
            "vartheta": 512,
            "mathscr": 513,
            "tan": 514,
            "over": 515,
            "parrow": 516,
            "sla": 517,
            "op": 518,
            "rall": 519,
            "forall": 520,
            "uparrow": 521,
            "own": 522,
            "down": 523,
            "les": 524,
            "less": 525,
            "bigr": 526,
            "tt": 527,
            "bigl": 528,
            "rVert": 529,
            "pto": 530,
            "propto": 531,
            "downarrow": 532,
            "om": 533,
            "cap": 534,
            "sh": 535,
            "tr": 536,
            "bin": 537,
            "binom": 538,
            "mp": 539,
            "lesssim": 540,
            "sub": 541,
            "cup": 542,
            "underbrace": 543,
            "sta": 544,
            "stack": 545,
            "inus": 546,
            "lus": 547,
            "boldmath": 548,
            "Ġ'": 549,
            "oplus": 550,
            "cosh": 551,
            "minus": 552,
            "flo": 553,
            "floor": 554,
            "setminus": 555,
            "Ti": 556,
            "Tilde": 557,
            "lvert": 558,
            "angle": 559,
            "Bigr": 560,
            "ddot": 561,
            "Bigl": 562,
            "sinh": 563,
            "overset": 564,
            "rvert": 565,
            "er": 566,
            "rel": 567,
            "it": 568,
            "subset": 569,
            "scriptstyle": 570,
            "he": 571,
            "nt": 572,
            "textsc": 573,
            "stackrel": 574,
            "Xi": 575,
            "biggr": 576,
            "heck": 577,
            "check": 578,
            "lVert": 579,
            "li": 580,
            "Bar": 581,
            "mal": 582,
            "slant": 583,
            "varrho": 584,
            "iangle": 585,
            "triangle": 586,
            "nor": 587,
            "normal": 588,
            "leftrightarrow": 589,
            "nto": 590,
            "phanto": 591,
            "phantom": 592,
            "biggl": 593,
            "mathtt": 594,
            "map": 595,
            "sto": 596,
            "mapsto": 597,
            "slash": 598,
            "textup": 599,
            "gg": 600,
            "io": 601,
            "iota": 602,
            "leftarrow": 603,
            "textnormal": 604,
            "ts": 605,
            "textstyle": 606,
            "ddots": 607,
            "long": 608,
            "ro": 609,
            "roup": 610,
            "scriptscriptstyle": 611,
            "leqslant": 612,
            "underset": 613,
            "bu": 614,
            "bot": 615,
            "ec": 616,
            "llet": 617,
            "bullet": 618,
            "Right": 619,
            "Rightarrow": 620,
            "tin": 621,
            "tiny": 622,
            "á¸": 623,
            "Ġá¸": 624,
            "longrightarrow": 625,
            "rfloor": 626,
            "tit": 627,
            "textit": 628,
            "lfloor": 629,
            "limi": 630,
            "iint": 631,
            "il": 632,
            "arc": 633,
            "oint": 634,
            "mathop": 635,
            "on": 636,
            "mathit": 637,
            "cot": 638,
            "Re": 639,
            "not": 640,
            "ze": 641,
            "size": 642,
            "odot": 643,
            "limits": 644,
            "gtr": 645,
            "cfrac": 646,
            "group": 647,
            "overrightarrow": 648,
            "ing": 649,
            "Upsilon": 650,
            "cong": 651,
            "lbrace": 652,
            "ne": 653,
            "sma": 654,
            "arctan": 655,
            "upsilon": 656,
            "scriptsize": 657,
            "arp": 658,
            "ba": 659,
            "back": 660,
            "texttt": 661,
            "imath": 662,
            "subseteq": 663,
            "varsigma": 664,
            "ect": 665,
            "Ġ--": 666,
            "Im": 667,
            "od": 668,
            "rbrace": 669,
            "varpi": 670,
            "vee": 671,
            "gtrsim": 672,
            "backslash": 673,
            "Vec": 674,
            "Ġ\\_": 675,
            "spa": 676,
            "col": 677,
            "xrightarrow": 678,
            "space": 679,
            "Ġ\\#": 680,
            "bj": 681,
            "bject": 682,
            "colon": 683,
            "ring": 684,
            "brack": 685,
            "Le": 686,
            "Left": 687,
            "Ġá¸Į": 688,
            "small": 689,
            "Ġá¸Ĭ": 690,
            "mathring": 691,
            "hdots": 692,
            "nd": 693,
            "land": 694,
            "gets": 695,
            "arg": 696,
            "ist": 697,
            "exist": 698,
            "exists": 699,
            "no": 700,
            "bre": 701,
            "eil": 702,
            "rceil": 703,
            "lce": 704,
            "lceil": 705,
            "Leftrightarrow": 706,
            "bigcup": 707,
            "varkappa": 708,
            "substack": 709,
            "mathopen": 710,
            "mathc": 711,
            "Lo": 712,
            "Long": 713,
            "lose": 714,
            "mathclose": 715,
            "triangleq": 716,
            "es": 717,
            "imp": 718,
            "lies": 719,
            "implies": 720,
            "sharp": 721,
            "em": 722,
            "prec": 723,
            "mod": 724,
            "fter": 725,
            "Biggl": 726,
            "after": 727,
            "bgroup": 728,
            "egroup": 729,
            "aftergroup": 730,
            "breve": 731,
            "pty": 732,
            "empty": 733,
            "emptyset": 734,
            "geqslant": 735,
            "Biggr": 736,
            "inter": 737,
            "coth": 738,
            "intercal": 739,
            "\\%": 740,
            "textsf": 741,
            "vphantom": 742,
            "jmath": 743,
            "Dot": 744,
            "Ġ\\/": 745,
            "bmod": 746,
            "varDelta": 747,
            "dim": 748,
            "sec": 749,
            "cu": 750,
            "sup": 751,
            "bigoplus": 752,
            "lbrack": 753,
            "dle": 754,
            "middle": 755,
            "ker": 756,
            "ff": 757,
            "dotsc": 758,
            "bo": 759,
            "box": 760,
            "supset": 761,
            "object": 762,
            "ĠObject": 763,
            "arpo": 764,
            "Ġ\"": 765,
            "notin": 766,
            "mber": 767,
            "number": 768,
            "nonumber": 769,
            "ner": 770,
            "arcsin": 771,
            "lim": 772,
            "lor": 773,
            "atop": 774,
            "lat": 775,
            "cc": 776,
            "Ġâ": 777,
            "succ": 778,
            "flat": 779,
            "mathor": 780,
            "mathord": 781,
            "iff": 782,
            "neg": 783,
            "wp": 784,
            "pmod": 785,
            "dash": 786,
            "ter": 787,
            "Longrightarrow": 788,
            "overbrace": 789,
            "emp": 790,
            "emph": 791,
            "iiint": 792,
            "ph": 793,
            "upmu": 794,
            "ale": 795,
            "csc": 796,
            "tharpo": 797,
            "aleph": 798,
            "rbrack": 799,
            "div": 800,
            "ru": 801,
            "bigotimes": 802,
            "deg": 803,
            "Longleftrightarrow": 804,
            "smash": 805,
            "thin": 806,
            "enspace": 807,
            "ds": 808,
            "thinspace": 809,
            "lefteq": 810,
            "hslash": 811,
            "te": 812,
            "dia": 813,
            "triangledown": 814,
            "bigcap": 815,
            "bigwedge": 816,
            "otnot": 817,
            "footnot": 818,
            "footnote": 819,
            "acu": 820,
            "acute": 821,
            "lnot": 822,
            "Ha": 823,
            "Hat": 824,
            "ip": 825,
            "kip": 826,
            "mon": 827,
            "displaylimits": 828,
            "diamon": 829,
            "diamond": 830,
            "lefteqn": 831,
            "vdash": 832,
            "varOmega": 833,
            "footnotesize": 834,
            "Ġ\\&": 835,
            "thing": 836,
            "varno": 837,
            "varnothing": 838,
            "rner": 839,
            "corner": 840,
            "llde": 841,
            "nullde": 842,
            "limiter": 843,
            "kern": 844,
            "nulldelimiter": 845,
            "nulldelimiterspace": 846,
            "ominus": 847,
            "\\!": 848,
            "sqcup": 849,
            "ddagger": 850,
            "\\,": 851,
            "AA": 852,
            "mit": 853,
            "mathin": 854,
            "mathinner": 855,
            "tharpoon": 856,
            "Ġex": 857,
            "dig": 858,
            "righ": 859,
            "mathbin": 860,
            "lessgtr": 861,
            "digamma": 862,
            "ddag": 863,
            "hphantom": 864,
            "doteq": 865,
            "ral": 866,
            "triangleright": 867,
            "rule": 868,
            "rly": 869,
            "curly": 870,
            "longleftrightarrow": 871,
            "\\&": 872,
            "ni": 873,
            "font": 874,
            "triangleleft": 875,
            "overleftrightarrow": 876,
            "longmapsto": 877,
            "circle": 878,
            "arge": 879,
            "ver": 880,
            "ok": 881,
            "hook": 882,
            "preceq": 883,
            "boxed": 884,
            "ĠâĢ": 885,
            "hf": 886,
            "\\#": 887,
            "varLambda": 888,
            "varPsi": 889,
            "oun": 890,
            "poun": 891,
            "pounds": 892,
            "boxtimes": 893,
            "cen": 894,
            "Ġ@": 895,
            "lef": 896,
            "onu": 897,
            "tharpoonu": 898,
            "tharpoonup": 899,
            "normalfont": 900,
            "pprox": 901,
            "bigtriangle": 902,
            "bigtriangleup": 903,
            "ak": 904,
            "updownarrow": 905,
            "leme": 906,
            "comp": 907,
            "lement": 908,
            "complement": 909,
            "rcorner": 910,
            "be": 911,
            "tu": 912,
            "Ġ\\-": 913,
            "natu": 914,
            "natural": 915,
            "curlyeq": 916,
            "prot": 917,
            "tering": 918,
            "centering": 919,
            "protect": 920,
            "mo": 921,
            "mathrel": 922,
            "hookrightarrow": 923,
            "supseteq": 924,
            "verb": 925,
            "ill": 926,
            "leftharpoon": 927,
            "Uparrow": 928,
            "gt": 929,
            "meds": 930,
            "medskip": 931,
            "rightharpoonup": 932,
            "hfill": 933,
            "large": 934,
            "suit": 935,
            "break": 936,
            "Down": 937,
            "Downarrow": 938,
            "stru": 939,
            "strut": 940,
            "ĬĹ": 941,
            "ĠâĬĹ": 942,
            "ltimes": 943,
            "lrcorner": 944,
            "low": 945,
            "overleftarrow": 946,
            "dotsb": 947,
            "sb": 948,
            "bigvee": 949,
            "skip": 950,
            "textsub": 951,
            "Leftarrow": 952,
            "textsubscript": 953,
            "beth": 954,
            "allow": 955,
            "succeq": 956,
            "leftarrows": 957,
            "Ġ---": 958,
            "ĠâĢĵ": 959,
            "\\;": 960,
            "rightleftharpoon": 961,
            "rightleftharpoons": 962,
            "searrow": 963,
            "mode": 964,
            "harpo": 965,
            "harpoon": 966,
            "tw": 967,
            "allowbreak": 968,
            "Up": 969,
            "nsim": 970,
            "gra": 971,
            "cdotp": 972,
            "oslash": 973,
            "Ġ?": 974,
            "det": 975,
            "Bre": 976,
            "Bigm": 977,
            "Breve": 978,
            "rtimes": 979,
            "Ġ`": 980,
            "black": 981,
            "upr": 982,
            "uprho": 983,
            "\\_": 984,
            "eqno": 985,
            "subsetneq": 986,
            "bigcirc": 987,
            "uptau": 988,
            "grave": 989,
            "asy": 990,
            "fint": 991,
            "rightleftarrows": 992,
            "dast": 993,
            "circled": 994,
            "circledast": 995,
            "asymp": 996,
            "lap": 997,
            "bigstar": 998,
            "dotsm": 999,
            "ðĿ": 1000,
            "ĠðĿ": 1001,
            "rapprox": 1002,
            "bigtriangledown": 1003,
            "gtrapprox": 1004,
            "null": 1005,
            "Vdash": 1006,
            "ase": 1007,
            "ĠÎ": 1008,
            "varPhi": 1009,
            "rcase": 1010,
            "Da": 1011,
            "Updownarrow": 1012,
            "Dash": 1013,
            "plus": 1014,
            "uff": 1015,
            "shuff": 1016,
            "shuffle": 1017,
            "ohe": 1018,
            "longleftarrow": 1019,
            "twohe": 1020,
            "twohead": 1021,
            "md": 1022,
            "textmd": 1023,
            "ub": 1024,
            "upalpha": 1025,
            "Ddot": 1026,
            "sl": 1027,
            "percase": 1028,
            "vrule": 1029,
            "mathbfit": 1030,
            "uplambda": 1031,
            "mathstrut": 1032,
            "uplus": 1033,
            "Bb": 1034,
            "bk": 1035,
            "Bbbk": 1036,
            "ere": 1037,
            "ls": 1038,
            "napprox": 1039,
            "unboldmath": 1040,
            "models": 1041,
            "Chi": 1042,
            "rlap": 1043,
            "upzeta": 1044,
            "overbar": 1045,
            "lessapprox": 1046,
            "rightharpoon": 1047,
            "mpe": 1048,
            "gtrless": 1049,
            "nearrow": 1050,
            "mpeq": 1051,
            "rrangle": 1052,
            "squ": 1053,
            "igarrow": 1054,
            "rightsqu": 1055,
            "varTheta": 1056,
            "bigm": 1057,
            "widecheck": 1058,
            "upbeta": 1059,
            "rightsquigarrow": 1060,
            "leftrightarrows": 1061,
            "rve": 1062,
            "ĠÂ": 1063,
            "ķį": 1064,
            "Ġ\\=": 1065,
            "leth": 1066,
            "daleth": 1067,
            "curve": 1068,
            "ĠðĿķį": 1069,
            "curvearrow": 1070,
            "warrow": 1071,
            "nrightarrow": 1072,
            "dddot": 1073,
            "there": 1074,
            "llcorner": 1075,
            "fore": 1076,
            "therefore": 1077,
            "bigsqcup": 1078,
            "uppi": 1079,
            "upnu": 1080,
            "vDash": 1081,
            "mathnormal": 1082,
            "tail": 1083,
            "neqq": 1084,
            "rd": 1085,
            "surd": 1086,
            "ree": 1087,
            "upharpoon": 1088,
            "itOmega": 1089,
            "succcurlyeq": 1090,
            "nmid": 1091,
            "Ġ\\*": 1092,
            "mathbfcal": 1093,
            "smallskip": 1094,
            "twoheadrightarrow": 1095,
            "jlim": 1096,
            "inde": 1097,
            "sun": 1098,
            "line": 1099,
            "qgtr": 1100,
            "bigodot": 1101,
            "uppercase": 1102,
            "lesse": 1103,
            "angles": 1104,
            "iiiint": 1105,
            "enskip": 1106,
            "textsl": 1107,
            "lneq": 1108,
            "nleftrightarrow": 1109,
            "intop": 1110,
            "nnu": 1111,
            "mannu": 1112,
            "meral": 1113,
            "romannu": 1114,
            "ĠâĪ": 1115,
            "romannumeral": 1116,
            "oparrow": 1117,
            "qless": 1118,
            "smi": 1119,
            "three": 1120,
            "looparrow": 1121,
            "dotseq": 1122,
            "eqslant": 1123,
            "underbar": 1124,
            "downharpoon": 1125,
            "trianglelefteq": 1126,
            "backprime": 1127,
            "trianglerighteq": 1128,
            "gtre": 1129,
            "smile": 1130,
            "threetimes": 1131,
            "diamondsuit": 1132,
            "--": 1133,
            "bow": 1134,
            "tie": 1135,
            "lax": 1136,
            "relax": 1137,
            "upuparrow": 1138,
            "bowtie": 1139,
            "upuparrows": 1140,
            "Large": 1141,
            "frow": 1142,
            "ke": 1143,
            "boxplus": 1144,
            "frown": 1145,
            "nleftarrow": 1146,
            "wr": 1147,
            "barwedge": 1148,
            "upgamma": 1149,
            "ĠâĢĻ": 1150,
            "circledcirc": 1151,
            "bumpeq": 1152,
            "asure": 1153,
            "measure": 1154,
            "dangle": 1155,
            "coprod": 1156,
            "approxeq": 1157,
            "measuredangle": 1158,
            "textmu": 1159,
            "smallint": 1160,
            "preccurlyeq": 1161,
            "\\:": 1162,
            "au": 1163,
            "bec": 1164,
            "uppsi": 1165,
            "ause": 1166,
            "because": 1167,
            "sqcap": 1168,
            "normalcol": 1169,
            "moon": 1170,
            "normalcolor": 1171,
            "Sub": 1172,
            "ick": 1173,
            "rk": 1174,
            "mark": 1175,
            "thick": 1176,
            "dotplus": 1177,
            "upsigma": 1178,
            "rightharpoondown": 1179,
            "ĠÂ·": 1180,
            "Subset": 1181,
            "thickspace": 1182,
            "Rsh": 1183,
            "amal": 1184,
            "et": 1185,
            "ever": 1186,
            "lg": 1187,
            "ymath": 1188,
            "deset": 1189,
            "sideset": 1190,
            "biguplus": 1191,
            "updelta": 1192,
            "normalsize": 1193,
            "bracket": 1194,
            "circleddash": 1195,
            "amalg": 1196,
            "everymath": 1197,
            "Pr": 1198,
            "nexists": 1199,
            "swarrow": 1200,
            "ĠÏ": 1201,
            "super": 1202,
            "varlim": 1203,
            "textsuper": 1204,
            "leqq": 1205,
            "rightarrowtail": 1206,
            "upkappa": 1207,
            "boxdot": 1208,
            "index": 1209,
            "textsuperscript": 1210,
            "downdownarrow": 1211,
            "hookleftarrow": 1212,
            "blacktriangleright": 1213,
            "blacktriangleleft": 1214,
            "curvearrowright": 1215,
            "upharpoonright": 1216,
            "downdownarrows": 1217,
            "mho": 1218,
            "vline": 1219,
            "xleftarrow": 1220,
            "ĠÃ": 1221,
            "ĠÐ": 1222,
            "Ġï": 1223,
            "underbracket": 1224,
            "checkmark": 1225,
            "precsim": 1226,
            "curvearrowleft": 1227,
            "gime": 1228,
            "sqsubset": 1229,
            "backsim": 1230,
            "backsimeq": 1231,
            "Longleftarrow": 1232,
            "gimel": 1233,
            "cl": 1234,
            "her": 1235,
            "ical": 1236,
            "nparallel": 1237,
            "nsubseteq": 1238,
            "nwarrow": 1239,
            "ri": 1240,
            "rightrightarrow": 1241,
            "desuit": 1242,
            "spher": 1243,
            "ggg": 1244,
            "spadesuit": 1245,
            "ubsuit": 1246,
            "clubsuit": 1247,
            "icalangle": 1248,
            "rightrightarrows": 1249,
            "sphericalangle": 1250,
            "nleq": 1251,
            "nRightarrow": 1252,
            "qqgtr": 1253,
            "Ġcm": 1254,
            "varpro": 1255,
            "vartriangleright": 1256,
            "dashv": 1257,
            "leftharpoondown": 1258,
            "lesseqqgtr": 1259,
            "varprojlim": 1260,
            "ave": 1261,
            "sco": 1262,
            "ske": 1263,
            "tsuit": 1264,
            "artsuit": 1265,
            "leave": 1266,
            "injlim": 1267,
            "leftrightharpoon": 1268,
            "ngeq": 1269,
            "varinjlim": 1270,
            "textunder": 1271,
            "heartsuit": 1272,
            "boxminus": 1273,
            "ĠÎ¸": 1274,
            "score": 1275,
            "skew": 1276,
            "leftrightharpoons": 1277,
            "textunderscore": 1278,
            "Rrightarrow": 1279,
            "cd": 1280,
            "fi": 1281,
            "gcd": 1282,
            "if": 1283,
            "ice": 1284,
            "nless": 1285,
            "ncong": 1286,
            "nsupseteq": 1287,
            "nVdash": 1288,
            "wi": 1289,
            "hoice": 1290,
            "sqsubseteq": 1291,
            "ideon": 1292,
            "astro": 1293,
            "veebar": 1294,
            "mathchoice": 1295,
            "supsetneq": 1296,
            "succsim": 1297,
            "divideon": 1298,
            "lesseqgtr": 1299,
            "lneqq": 1300,
            "astrosun": 1301,
            "divideontimes": 1302,
            "Bu": 1303,
            "Cap": 1304,
            "Cup": 1305,
            "Lsh": 1306,
            "Lleftarrow": 1307,
            "Sup": 1308,
            "Vvdash": 1309,
            "VDash": 1310,
            "aa": 1311,
            "eth": 1312,
            "een": 1313,
            "fal": 1314,
            "gneq": 1315,
            "gnsim": 1316,
            "gnapprox": 1317,
            "gneqq": 1318,
            "gdotseq": 1319,
            "lti": 1320,
            "ling": 1321,
            "lcorner": 1322,
            "lnapprox": 1323,
            "nLeftrightarrow": 1324,
            "nprec": 1325,
            "nsucc": 1326,
            "nvdash": 1327,
            "nLeftarrow": 1328,
            "nvDash": 1329,
            "ntrianglelefteq": 1330,
            "ntrianglerighteq": 1331,
            "nVDash": 1332,
            "qqless": 1333,
            "urcorner": 1334,
            "ulcorner": 1335,
            "¿½": 1336,
            "rightthreetimes": 1337,
            "leftleftarrows": 1338,
            "leftrightsquigarrow": 1339,
            "leftthreetimes": 1340,
            "ngtr": 1341,
            "multi": 1342,
            "vartriangle": 1343,
            "vartriangleleft": 1344,
            "sqsupset": 1345,
            "sqsupseteq": 1346,
            "lll": 1347,
            "singdotseq": 1348,
            "lnsim": 1349,
            "geqq": 1350,
            "circeq": 1351,
            "eqsim": 1352,
            "eqcirc": 1353,
            "uptheta": 1354,
            "lessdot": 1355,
            "leftarrowtail": 1356,
            "gtrdot": 1357,
            "precnsim": 1358,
            "succnsim": 1359,
            "diag": 1360,
            "curlywedge": 1361,
            "curlyvee": 1362,
            "leftharpoonup": 1363,
            "betw": 1364,
            "curlyeqprec": 1365,
            "curlyeqsucc": 1366,
            "twoheadleftarrow": 1367,
            "upharpoonleft": 1368,
            "looparrowright": 1369,
            "looparrowleft": 1370,
            "eqslantless": 1371,
            "eqslantgtr": 1372,
            "downharpoonright": 1373,
            "downharpoonleft": 1374,
            "gtreqless": 1375,
            "gtreqqless": 1376,
            "Ġï¿½": 1377,
            "risingdotseq": 1378,
            "Bumpeq": 1379,
            "Supset": 1380,
            "falling": 1381,
            "multimap": 1382,
            "between": 1383,
            "fallingdotseq": 1384,
            "el": 1385,
            "mmode": 1386,
            "ĵĿ": 1387,
            "Ġ\\^": 1388,
            "upxi": 1389,
            "ĠðĿĵĿ": 1390,
            "varlimsup": 1391,
            "ifmmode": 1392,
            "else": 1393,
            "llangle": 1394,
            "ref": 1395,
            "Mak": 1396,
            "eUp": 1397,
            "llap": 1398,
            "oin": 1399,
            "Ĺģ": 1400,
            "Ġ\\'": 1401,
            "rightmoon": 1402,
            "Ġem": 1403,
            "cite": 1404,
            "ĠâĹģ": 1405,
            "hfil": 1406,
            "indent": 1407,
            "MakeUp": 1408,
            "MakeUppercase": 1409,
            "ĠÎĵ": 1410,
            "with": 1411,
            "SS": 1412,
            "operatornamewith": 1413,
            "string": 1414,
            "upomega": 1415,
            "operatornamewithlimits": 1416,
            "Nu": 1417,
            "do": 1418,
            "ned": 1419,
            "oneq": 1420,
            "oiint": 1421,
            "oiiint": 1422,
            "wline": 1423,
            "Ġ\\\"": 1424,
            "rai": 1425,
            "make": 1426,
            "igned": 1427,
            "aligned": 1428,
            "newline": 1429,
            "coloneq": 1430,
            "ĠÂ°": 1431,
            "ĠÃĹ": 1432,
            "makebox": 1433,
            "16": 1434,
            "dprime": 1435,
            "mathpa": 1436,
            "lett": 1437,
            "hom": 1438,
            "varGamma": 1439,
            "textcen": 1440,
            "mathsfit": 1441,
            "leftrightarrowtriangle": 1442,
            "blacktriangle": 1443,
            "mathpalett": 1444,
            "textcent": 1445,
            "mathpalette": 1446,
            "ct": 1447,
            "min": 1448,
            "leftmoon": 1449,
            "upphi": 1450,
            "upSigma": 1451,
            "itSigma": 1452,
            "Ġâģ": 1453,
            "diagdown": 1454,
            "ami": 1455,
            "fami": 1456,
            "idots": 1457,
            "ly": 1458,
            "pth": 1459,
            "tc": 1460,
            "lect": 1461,
            "depth": 1462,
            "varXi": 1463,
            "textless": 1464,
            "sebox": 1465,
            "select": 1466,
            "fontfami": 1467,
            "updownarrows": 1468,
            "ĠâĪĴ": 1469,
            "raisebox": 1470,
            "ĠâģĦ": 1471,
            "idotsint": 1472,
            "selectfont": 1473,
            "fontfamily": 1474,
            "Check": 1475,
            "cmp": 1476,
            "dspace": 1477,
            "fcmp": 1478,
            "vmode": 1479,
            "ĠÄ": 1480,
            "Ġ\\(": 1481,
            "Ġ\\)": 1482,
            "lebarwedge": 1483,
            "medspace": 1484,
            "tion": 1485,
            "Ġmm": 1486,
            "pitc": 1487,
            "biggm": 1488,
            "ork": 1489,
            "nobreak": 1490,
            "interleave": 1491,
            "hfork": 1492,
            "blacktriangledown": 1493,
            "ublebarwedge": 1494,
            "leavevmode": 1495,
            "doublebarwedge": 1496,
            "pitchfork": 1497,
            "nobreakspace": 1498,
            "Ga": 1499,
            "Lt": 1500,
            "ater": 1501,
            "dj": 1502,
            "gre": 1503,
            "ule": 1504,
            "textcircled": 1505,
            "textgre": 1506,
            "displaybreak": 1507,
            "subseteqq": 1508,
            "precapprox": 1509,
            "allowdisplaybreak": 1510,
            "ĠâĪ«": 1511,
            "Game": 1512,
            "textgreater": 1513,
            "allowdisplaybreaks": 1514,
            "Join": 1515,
            "\\=": 1516,
            "mathsec": 1517,
            "dotsi": 1518,
            "textrangle": 1519,
            "textlangle": 1520,
            "upeta": 1521,
            "itGamma": 1522,
            "precnapprox": 1523,
            "precneqq": 1524,
            "supsetneqq": 1525,
            "succneqq": 1526,
            "subsetneqq": 1527,
            "mathsection": 1528,
            "AR": 1529,
            "Fin": 1530,
            "GE": 1531,
            "LAR": 1532,
            "join": 1533,
            "py": 1534,
            "reg": 1535,
            "inf": 1536,
            "endgroup": 1537,
            "begingroup": 1538,
            "textper": 1539,
            "textreg": 1540,
            "copy": 1541,
            "upOmega": 1542,
            "istere": 1543,
            "Ġâī": 1544,
            "succnapprox": 1545,
            "ĠâĢ¦": 1546,
            "---": 1547,
            "varliminf": 1548,
            "Finv": 1549,
            "LARGE": 1550,
            "joinrel": 1551,
            "textregistere": 1552,
            "copyright": 1553,
            "textregistered": 1554,
            "and": 1555,
            "ercase": 1556,
            "gon": 1557,
            "nda": 1558,
            "ous": 1559,
            "uge": 1560,
            "Ħĵ": 1561,
            "thous": 1562,
            "mathpara": 1563,
            "endaligned": 1564,
            "expa": 1565,
            "textem": 1566,
            "backepsilon": 1567,
            "ĠâĦĵ": 1568,
            "supseteqq": 1569,
            "lowercase": 1570,
            "graph": 1571,
            "ĠâĪĺ": 1572,
            "ĠâĪŀ": 1573,
            "diagup": 1574,
            "textperthous": 1575,
            "ndafter": 1576,
            "mathparagraph": 1577,
            "expandafter": 1578,
            "textemdash": 1579,
            "textperthousand": 1580,
            "agon": 1581,
            "dow": 1582,
            "hex": 1583,
            "ipsi": 1584,
            "mathell": 1585,
            "Ġpt": 1586,
            "nuparrow": 1587,
            "textbar": 1588,
            "textdeg": 1589,
            "succapprox": 1590,
            "ĠÐµ": 1591,
            "downuparrow": 1592,
            "hexagon": 1593,
            "ipsis": 1594,
            "mathellipsis": 1595,
            "textdegree": 1596,
            "downuparrows": 1597,
            "Huge": 1598,
            "¼Į": 1599,
            "max": 1600,
            "arraycol": 1601,
            "varSigma": 1602,
            "varPi": 1603,
            "sep": 1604,
            "underrightarrow": 1605,
            "ĠÎµ": 1606,
            "ĠÎ½": 1607,
            "ĠÏĨ": 1608,
            "Ġï¼Į": 1609,
            "ĠÄĩ": 1610,
            "ĠÄį": 1611,
            "arraycolsep": 1612,
            "AE": 1613,
            "And": 1614,
            "Beta": 1615,
            "ddddot": 1616,
            "ss": 1617,
            "Â±": 1618,
            "ĭħ": 1619,
            "labe": 1620,
            "sumint": 1621,
            "Biggm": 1622,
            "overrightharpoon": 1623,
            "Ġâĭħ": 1624,
            "negmedspace": 1625,
            "ĠÏī": 1626,
            "ĠÃ©": 1627,
            "ĠÐ³": 1628,
            "ĠÐ´": 1629,
            "ĠÐ¸": 1630,
            "Ġâīħ": 1631,
            "label": 1632,
            "\\*": 1633,
            "dth": 1634,
            "hspace": 1635,
            "hskip": 1636,
            "hss": 1637,
            "pu": 1638,
            "the": 1639,
            "bfse": 1640,
            "def": 1641,
            "dewi": 1642,
            "hidewi": 1643,
            "llback": 1644,
            "texttimes": 1645,
            "upDelta": 1646,
            "underleftarrow": 1647,
            "á¸Ĭ": 1648,
            "negthickspace": 1649,
            "footnotemark": 1650,
            "ĠâĢĶ": 1651,
            "ĠÎ©": 1652,
            "ĠÎ·": 1653,
            "ĠÏĥ": 1654,
            "ries": 1655,
            "Ġâī¤": 1656,
            "pullback": 1657,
            "bfseries": 1658,
            "hidewidth": 1659,
            "ae": 1660,
            "is": 1661,
            "ize": 1662,
            "ken": 1663,
            "lgroup": 1664,
            "rgroup": 1665,
            "seta": 1666,
            "frame": 1667,
            "deto": 1668,
            "varUpsilon": 1669,
            "bigskip": 1670,
            "seline": 1671,
            "upvarepsilon": 1672,
            "overbracket": 1673,
            "owns": 1674,
            "baseline": 1675,
            "ĠÎ¿": 1676,
            "ĠÎĶ": 1677,
            "ĠÂ²": 1678,
            "ĠâĪĳ": 1679,
            "ĠÏĢ": 1680,
            "ĠÏĩ": 1681,
            "ĠÏĮ": 1682,
            "raiseta": 1683,
            "isvec": 1684,
            "kenize": 1685,
            "framebox": 1686,
            "detokenize": 1687,
            "baselineskip": 1688,
            "raisetag": 1689,
            "DO": 1690,
            "SB": 1691,
            "TSB": 1692,
            "Zeta": 1693,
            "\\-": 1694,
            "ation": 1695,
            "bslash": 1696,
            "dleft": 1697,
            "eu": 1698,
            "fill": 1699,
            "gge": 1700,
            "huge": 1701,
            "ldot": 1702,
            "mt": 1703,
            "nsimeq": 1704,
            "smt": 1705,
            "Â´": 1706,
            "Î»": 1707,
            "ÎĶ": 1708,
            "Ñĩ": 1709,
            "âĢ": 1710,
            "âŁ": 1711,
            "ĠÑĩ": 1712,
            "Ł©": 1713,
            "Ġ\\.": 1714,
            "Ġ\\`": 1715,
            "ragge": 1716,
            "mathbfscr": 1717,
            "bigtimes": 1718,
            "textre": 1719,
            "texteu": 1720,
            "dotso": 1721,
            "equation": 1722,
            "cipe": 1723,
            "upepsilon": 1724,
            "ointop": 1725,
            "noindent": 1726,
            "boxbslash": 1727,
            "ĠâŁ©": 1728,
            "ĠÎ»": 1729,
            "ĠâĪĪ": 1730,
            "ĠÏĦ": 1731,
            "ĠÏħ": 1732,
            "ĠÏĪ": 1733,
            "ĠÃ¡": 1734,
            "ĠÃ¶": 1735,
            "ĠÐ°": 1736,
            "ĠÐ½": 1737,
            "DOTSB": 1738,
            "ldotp": 1739,
            "âĢĵ": 1740,
            "âŁ¨": 1741,
            "raggedleft": 1742,
            "textrecipe": 1743,
            "texteuro": 1744,
            "\\/": 1745,
            "bal": 1746,
            "dcen": 1747,
            "eright": 1748,
            "ead": 1749,
            "erline": 1750,
            "edef": 1751,
            "fbox": 1752,
            "glo": 1753,
            "gdef": 1754,
            "ij": 1755,
            "mspace": 1756,
            "nol": 1757,
            "of": 1758,
            "off": 1759,
            "pen": 1760,
            "qop": 1761,
            "rq": 1762,
            "sha": 1763,
            "spr": 1764,
            "spe": 1765,
            "tplus": 1766,
            "tmspace": 1767,
            "Â¨": 1768,
            "Î´": 1769,
            "âĪ": 1770,
            "Ġ10": 1771,
            "mathgroup": 1772,
            "tagon": 1773,
            "meter": 1774,
            "arrayst": 1775,
            "delim": 1776,
            "oteright": 1777,
            "day": 1778,
            "muskip": 1779,
            "lock": 1780,
            "interline": 1781,
            "boldgroup": 1782,
            "quoteright": 1783,
            "today": 1784,
            "textbackslash": 1785,
            "textcopyright": 1786,
            "textquoteright": 1787,
            "inebreak": 1788,
            "red": 1789,
            "retc": 1790,
            "scsha": 1791,
            "rclock": 1792,
            "cial": 1793,
            "upvarphi": 1794,
            "upchi": 1795,
            "overwith": 1796,
            "subequation": 1797,
            "normalbaselineskip": 1798,
            "iodcen": 1799,
            "root": 1800,
            "ointct": 1801,
            "thinmuskip": 1802,
            "tered": 1803,
            "diameter": 1804,
            "ĠâĢĲ": 1805,
            "ĠâĢł": 1806,
            "ĠÎ±": 1807,
            "ĠÎ²": 1808,
            "ĠÎ¹": 1809,
            "ĠÎº": 1810,
            "ĠÎ¼": 1811,
            "ĠÂ£": 1812,
            "ĠÂ¨": 1813,
            "ĠÂ®": 1814,
            "ĠÂ¯": 1815,
            "ĠÂµ": 1816,
            "ĠÂ¸": 1817,
            "linespr": 1818,
            "ĠÃ°": 1819,
            "ĠÃħ": 1820,
            "ĠÃł": 1821,
            "ĠÐ¶": 1822,
            "ĠÐĶ": 1823,
            "wise": 1824,
            "Ġâģ¡": 1825,
            "textperiodcen": 1826,
            "theequation": 1827,
            "theboldgroup": 1828,
            "thesubequation": 1829,
            "global": 1830,
            "nolinebreak": 1831,
            "offinterline": 1832,
            "pentagon": 1833,
            "qopname": 1834,
            "special": 1835,
            "âĪĴ": 1836,
            "arraystretc": 1837,
            "delims": 1838,
            "scshape": 1839,
            "rclockwise": 1840,
            "overwithdelims": 1841,
            "ointctrclockwise": 1842,
